# AnalyticalLinkReleaseRotationX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalLinkReleaseRotationX Property
ParameterTypeId Class See Also
---
"X Rotation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalLinkReleaseRotationX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalLinkReleaseRotationX As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalLinkReleaseRotationX {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace